Repository: AndreuCodina/CrossValidation
Catalog: src/CrossValidation/Resources/ErrorResource.*.resx
Languages: es

# GreaterThan
source: Must be greater than {fieldValue}
es: Debe ser mayor que {comparisonValue}

# NotNull
source: Must have a value
es: Debe tener un valor

# Enum
source: Must be a valid value
es: Debe ser un valor válido

# Null
source: Must not have a value
es: No debe tener un valor

# MinimumLength
source: Must have at least {minimumLength} character(s)
es: Debe tener al menos {minimumLength} caracter(es)

# RegularExpression
source: The format is not valid
es: El formato no es válido

# Generic
source: An error has occured
es: Ha ocurrido un error

# NotEmptyString
source: Must have a value
es: Debe tener un valor

# EmptyString
source: Must not have a value
es: No debe tener un valor

# EmptyCollection
source: Must not add any value
es: No debes añadir ningún valor

# NotEmptyCollection
source: Must add a value
es: Debes añadir un valor

# MaximumLength
source: Must have no more than {maximumLength} characters(s)
es: No debe tener más de {maximumLength} caracter(es)

# GreaterThanOrEqual
source: Must be greater than or equal to {fieldValue}
es: Debe ser mayor o igual que {comparisonValue}
